dangnhien/psoc/theory/ds1307_with_uart/ds1307_with_uart.cydsn/codegentemp/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.4
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2020 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "i2c_ds1307.h"
#include "i2c_ds1307_I2C.h"
#include "i2c_ds1307_PINS.h"
#include "i2c_ds1307_I2C_PVT.h"
#include "i2c_ds1307_PVT.h"
#include "i2c_ds1307_BOOT.h"
#include "uart_transmit.h"
#include "uart_transmit_SPI_UART.h"
#include "uart_transmit_PINS.h"
#include "uart_transmit_SPI_UART_PVT.h"
#include "uart_transmit_PVT.h"
#include "uart_transmit_BOOT.h"
#include "Pin_Led_Yellow.h"
#include "Pin_Led_Yellow_aliases.h"
#include "i2c_ds1307_SCBCLK.h"
#include "i2c_ds1307_sda.h"
#include "i2c_ds1307_sda_aliases.h"
#include "i2c_ds1307_scl.h"
#include "i2c_ds1307_scl_aliases.h"
#include "i2c_ds1307_SCB_IRQ.h"
#include "uart_transmit_SCBCLK.h"
#include "uart_transmit_tx.h"
#include "uart_transmit_tx_aliases.h"
#include "uart_transmit_rx.h"
#include "uart_transmit_rx_aliases.h"
#include "core_cm0_psoc4.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cyPm.h"
#include "cytypes.h"
#include "cypins.h"
#include "CyLFClk.h"
#include "cy_em_eeprom.h"

/*[]*/

